In [16]:
import pandas as pd
import numpy as np

In [5]:
ser = pd.Series()

In [6]:
ser

Series([], dtype: object)

In [7]:
ser=pd.Series([0,10,20,30,40,50,60,70,80,90])
print(ser)

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [8]:
ser = pd.Series([20,30,"10"])
ser

0    20
1    30
2    10
dtype: object

In [10]:
dict={'A':[1,2,3],'B':[5,8,9],'C':[1,2,3]}
df = pd.DataFrame(dict)
df

   A  B  C
0  1  5  1
1  2  8  2
2  3  9  3

In [11]:
#Adding new columns

In [12]:
df['State'] = "N:h:MP" .split(':')

In [13]:
df

   A  B  C State
0  1  5  1     N
1  2  8  2     h
2  3  9  3    MP

In [14]:
#creating Nan values and its manipulation

In [17]:
dict={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}
dict

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [18]:
df = pd.DataFrame(dict)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [19]:
print("\n Dropping any column with nan value\n",'-'*35,sep='')
print(df.dropna(axis=1))

 Dropping any column with nan value
-----------------------------------
   C
0  1
1  2
2  3

In [20]:
print(df) #there is no changes in original pandas beacuse we can not save the data..

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [21]:
print("\n Dropping any rows with a Nan Value\n",'-'*35)
print(df.dropna(axis=0))

 Dropping any rows with a Nan Value
 -----------------------------------
     A    B  C
0  1.0  5.0  1

In [22]:
##filling the nan with default value

In [23]:
print("\n Filling Value with a Default Value\n",'-'*35,sep='')
print(df.fillna(value=25))

 Filling Value with a Default Value
-----------------------------------
      A     B  C
0   1.0   5.0  1
1   2.0  25.0  2
2  25.0  25.0  3

In [24]:
# to make changes we can use inplace = True

In [25]:
print("\n Filling Values with a computed values (mean of a column A here)\n",'-'*60,sep='')
df.fillna(value=df['C'].mean(),inplace=True)#inplace=True means we save our data for future
print(df)

 Filling Values with a computed values (mean of a column A here)
------------------------------------------------------------
     A    B  C
0  1.0  5.0  1
1  2.0  2.0  2
2  2.0  2.0  3

In [26]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  2.0  2
2  2.0  2.0  3

In [32]:
class_a=pd.DataFrame({'Mat':[45,68,35,65],
                     'Eng':[54,87,36,52],
                     'Sci':[66,77,88,70],
                     'Chem':[54,79,58,76]},
                    index=['Ravi','Shyam','Saurav','Abhi'])
class_a

        Mat  Eng  Sci  Chem
Ravi     45   54   66    54
Shyam    68   87   77    79
Saurav   35   36   88    58
Abhi     65   52   70    76

In [28]:
class_b=pd.DataFrame({'Mat':[50,87,69,71],
                     'Eng':[66,50,87,69],
                     'Sci':[34,66,69,71],
                     'Chem':[54,87,34,66]},
                    index=['Shaan','Mahi','Viru','Mona'])
class_b

       Mat  Eng  Sci  Chem
Shaan   50   66   34    54
Mahi    87   50   66    87
Viru    69   87   69    34
Mona    71   69   71    66

In [29]:
class_c=pd.DataFrame({'Mat':[66,50,87,56],
                     'Eng':[56,87,89,71],
                     'Sci':[77,88,70,52],
                     'Chem':[34,56,56,87]},
                    index=['Astha','Rohit','Rahul','Shital'])
class_c

        Mat  Eng  Sci  Chem
Astha    66   56   77    34
Rohit    50   87   88    56
Rahul    87   89   70    56
Shital   56   71   52    87

In [33]:
all_student_marks=pd.concat([class_a,class_b,class_c],axis=0)
print("\n After concatenation along row \n",'-'*30,sep='')
print(all_student_marks)

 After concatenation along row
------------------------------
        Mat  Eng  Sci  Chem
Ravi     45   54   66    54
Shyam    68   87   77    79
Saurav   35   36   88    58
Abhi     65   52   70    76
Shaan    50   66   34    54
Mahi     87   50   66    87
Viru     69   87   69    34
Mona     71   69   71    66
Astha    66   56   77    34
Rohit    50   87   88    56
Rahul    87   89   70    56
Shital   56   71   52    87

In [34]:
#Concatenation

In [35]:
# axis = 0 means rows and axis = 1 means columns

In [36]:
df.cat2=pd.concat([class_a,class_b,class_c],axis=1)
print("\n Concat with column wise \n",'-'*60,sep='')
print(df.cat2)

 Concat with column wise
------------------------------------------------------------
         Mat   Eng   Sci  Chem   Mat   Eng   Sci  Chem   Mat   Eng   Sci  Chem
Ravi    45.0  54.0  66.0  54.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
Shyam   68.0  87.0  77.0  79.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
Saurav  35.0  36.0  88.0  58.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
Abhi    65.0  52.0  70.0  76.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
Shaan    NaN   NaN   NaN   NaN  50.0  66.0  34.0  54.0   NaN   NaN   NaN   NaN
Mahi     NaN   NaN   NaN   NaN  87.0  50.0  66.0  87.0   NaN   NaN   NaN   NaN
Viru     NaN   NaN   NaN   NaN  69.0  87.0  69.0  34.0   NaN   NaN   NaN   NaN
Mona     NaN   NaN   NaN   NaN  71.0  69.0  71.0  66.0   NaN   NaN   NaN   NaN
Astha    NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  66.0  56.0  77.0  34.0
Rohit    NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  50.0  87.0  88.0  56.0
Rahul    NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  87.0  89.0  70.0  56.0
Shital   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  56.0  71.0  52.0  87.0

C:\Users\surya\AppData\Local\Temp\ipykernel_7888\2155776424.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  df.cat2=pd.concat([class_a,class_b,class_c],axis=1)

In [38]:
df.cat2.fillna(value=0,inplace=True) ## filling the nan with zero and saving the changes by using inplace =true

In [39]:
df.cat2

         Mat   Eng   Sci  Chem   Mat   Eng   Sci  Chem   Mat   Eng   Sci  Chem
Ravi    45.0  54.0  66.0  54.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0
Shyam   68.0  87.0  77.0  79.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0
Saurav  35.0  36.0  88.0  58.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0
Abhi    65.0  52.0  70.0  76.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0
Shaan    0.0   0.0   0.0   0.0  50.0  66.0  34.0  54.0   0.0   0.0   0.0   0.0
Mahi     0.0   0.0   0.0   0.0  87.0  50.0  66.0  87.0   0.0   0.0   0.0   0.0
Viru     0.0   0.0   0.0   0.0  69.0  87.0  69.0  34.0   0.0   0.0   0.0   0.0
Mona     0.0   0.0   0.0   0.0  71.0  69.0  71.0  66.0   0.0   0.0   0.0   0.0
Astha    0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0  66.0  56.0  77.0  34.0
Rohit    0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0  50.0  87.0  88.0  56.0
Rahul    0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0  87.0  89.0  70.0  56.0
Shital   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0  56.0  71.0  52.0  87.0

In [40]:
#Merging

In [41]:
player_id_name=pd.DataFrame({'ID':[25,30,35,40,45,50,55],
                            'Name':['Ronaldo','Messi','Pele','Maradona','Harry','Pogba','Chhetri']})
print("Player Id and Name\n============================")
player_id_name

Player Id and Name
============================

   ID      Name
0  25   Ronaldo
1  30     Messi
2  35      Pele
3  40  Maradona
4  45     Harry
5  50     Pogba
6  55   Chhetri

In [43]:
player_detail=pd.DataFrame({'ID':[25,30,45,50,55],
                            'Age':[36,34,20,28,37],
                            'Country':['Porugal','Argentina','England','France','India']})
print("Player Details \n====================")
player_detail

Player Details
====================

   ID  Age    Country
0  25   36    Porugal
1  30   34  Argentina
2  45   20    England
3  50   28     France
4  55   37      India

In [44]:
print("======DataSet will Merged based on the ID's==========")
pd.merge(player_id_name,player_detail,on='ID')

======DataSet will Merged based on the ID's==========

   ID     Name  Age    Country
0  25  Ronaldo   36    Porugal
1  30    Messi   34  Argentina
2  45    Harry   20    England
3  50    Pogba   28     France
4  55  Chhetri   37      India

In [45]:
# Join operator

In [46]:
left=pd.DataFrame({'A':['A0','A1','A2'],
                  'B':['B0','B1','B2']},
                 index=['K0','K1','K2'])

In [47]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [48]:
right=pd.DataFrame({'C':['C0','C2','C3'],
                   'D':['D0','D2','D3']},
                  index=['K0','K2','K3'])

In [49]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [50]:
right.join(left) #the left one will get joined to right df

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

In [51]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2